#!/bin/sh

#------------------------------------------------------------------------------
# オートスケール関連設定
#------------------------------------------------------------------------------
#******************************************************************************
# Name       : APP_ROOT
# Description: オートスケールアプリ(sakura-auto-scling-with-docker)のルートパス
#******************************************************************************
APP_ROOT=$(cd $(dirname $0); pwd)

#******************************************************************************
# Name       : SAKURACLOUD_GSLB
# Description: さくらのクラウド上のGSLBの名称
#******************************************************************************
SAKURACLOUD_GSLB=sakura-autoscaling-gslb

#******************************************************************************
# Name       : MASTER_MACHINE_NAME
# Description: 常に起動しておくマシン(Masterノード)の名前
# Remarks    : DockerMachineにて作成されるマシン名は以下のようになる
#              ${MACHINE_NAME_PATTERN}-${MASTER_MACHINE_NAME}
#******************************************************************************
MASTER_MACHINE_NAME=master

#******************************************************************************
# Name       : IS_SETUP_MASTER
# Description: Masterノードが存在しない場合作成を行うか
#            : 1の場合は有効、以外の場合は無効
# Remarks    : Masterノードを手動で作成する場合は無効にする
#******************************************************************************
IS_SETUP_MASTER=1

#******************************************************************************
# Name       : MACHINE_NAME_PATTERN
# Description: さくらのクラウド上に作成されるマシンの
#              名称パターン(前方一致)
# Remarks    : マシン名の命名ルールは以下の通り
#      動的に作成されるマシン:
#          $MACHINE_NAME_PATTERN + "-client[1-5]
#******************************************************************************
MACHINE_NAME_PATTERN=sakura-autoscaling

#******************************************************************************
# Name       : MAX_SCALE_COUNT
# Description: スケールするサーバー台数
#              0 ~ $MAX_SCALE_COUNT台まで動的に作成される。
#              $MAX_SCALE_COUNT+常に起動しておくマシン数が
#              6(GSLBのIP最大数)を超えないこと
#******************************************************************************
MAX_SCALE_COUNT=5

#******************************************************************************
# Name       : CPU_TIME_SCALE_OUT_THRESHOLD
# Description: スケールアウト閾値(CPU時間:)
#              1コアあたり1の時100%の使用率となる(あくまで目安らしい)
#              http://cloud-news.sakura.ad.jp/activity/#server
#              複数コアのマシンでスケールアウトさせる場合は計算に注意
#******************************************************************************
CPU_TIME_SCALE_OUT_THRESHOLD=0.6 #60%以上のCPU負荷でスケールアウト

#******************************************************************************
# Name       : CPU_TIME_SCALE_IN_THRESHOLD
# Description: スケールイン閾値(CPU時間:)
#              CPU_TIME_SCALE_OUT_THRESHOLDの説明を参照
#******************************************************************************
CPU_TIME_SCALE_IN_THRESHOLD=0.4 #40%以下のCPU負荷でスケールイン

#******************************************************************************
# Name       : DOCKER_MACHINE_SCALEOUT_OPTIONS
# Description: docker-machine-sakuracloudへの追加オプション
#              コアを増やす、リージョンを変更するなどの場合は
#              ここにdocker-machine-sakuracloudのオプションを記載
#******************************************************************************
DOCKER_MACHINE_SCALEOUT_OPTIONS=""

#******************************************************************************
# Name       : CALC_CPU_DOCKER_COMPOSE_PATH
# Description: CPU時間計算用Dockerコンテナ(compose)のパス
#******************************************************************************
CALC_CPU_DOCKER_COMPOSE_PATH="$APP_ROOT/utils/sacloud-cputime"

#******************************************************************************
# Name       : DOCKER_MACHINE_COMPOSE_PATH
# Description: DockerMachine(+sakuracloud)用コンテナ(compose)のパス
#******************************************************************************
DOCKER_MACHINE_COMPOSE_PATH="$APP_ROOT/utils/docker-machine-sakuracloud"

#******************************************************************************
# Name       : WEB_APP_COMPOSE_PATH
# Description: WebアプリDockerコンテナ(compose)のパス
#******************************************************************************
WEB_APP_COMPOSE_PATH="$APP_ROOT/apps"

#------------------------------------------------------------------------------
# パス関連(必要に応じて変更)
#------------------------------------------------------------------------------
#******************************************************************************
# Name       : MACHINE_LIST_INFO_DIR
# Description: マシン一覧、マシンごとの環境情報を格納するワークディレクトリ
#******************************************************************************
MACHINE_LIST_INFO_DIR=/tmp/sakura_cloud_machine_list

#******************************************************************************
# Name       : DOCKER_COMPOSE
# Description: docker-composeコマンド
#******************************************************************************
DOCKER_COMPOSE=/usr/local/bin/docker-compose

#******************************************************************************
# Name       : DOCKER_MACHINE
# Description: docker-machineコマンド
#******************************************************************************
DOCKER_MACHINE=/usr/local/bin/docker-machine
